approximate-clique/A polyhedral study of the generalized vertex packing problem.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-22 Tue 23:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="陈小羽" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgff1794e">1. What is vertex packing problem (VP)</a></li>
<li><a href="#orgfe9c840">2. The generalized vertex packing problem (GVP-k) that this article cares about</a></li>
<li><a href="#org3517cdf">3. Some application</a></li>
<li><a href="#org906c3cb">4. Introduction</a>
<ul>
<li><a href="#orge93317b">4.1. Integer Programming Model (for VP)</a></li>
<li><a href="#org7627627">4.2. Prefect Graph</a></li>
<li><a href="#org25bb10c">4.3. Integer Programming Model (for GVP-k)</a></li>
</ul>
</li>
<li><a href="#orgdafd593">5. <span class="todo TODO">TODO</span> Facets and partial convex hull representations for GVP-k</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgff1794e" class="outline-2">
<h2 id="orgff1794e"><span class="section-number-2">1</span> What is vertex packing problem (VP)</h2>
<div class="outline-text-2" id="text-1">
<p>
The traditional vertex packing problem deﬁned on an
undirected graph identiﬁes the largest weighted independent
set of nodes, that is, a set of nodes whose induced subgraph 
contains no edges.
</p>
</div>
</div>
<div id="outline-container-orgfe9c840" class="outline-2">
<h2 id="orgfe9c840"><span class="section-number-2">2</span> The generalized vertex packing problem (GVP-k) that this article cares about</h2>
<div class="outline-text-2" id="text-2">
<p>
k edges may exist within the subgraph induced by the chosen set of nodes.
</p>
</div>
</div>
<div id="outline-container-org3517cdf" class="outline-2">
<h2 id="org3517cdf"><span class="section-number-2">3</span> Some application</h2>
<div class="outline-text-2" id="text-3">
<p>
A particular context in which such problems arise is in the national 
airspace planning model
</p>
</div>
</div>
<div id="outline-container-org906c3cb" class="outline-2">
<h2 id="org906c3cb"><span class="section-number-2">4</span> Introduction</h2>
<div class="outline-text-2" id="text-4">
<p>
G = (N, E), weighted c<sub>j</sub>, for j = 1, &ctdot;, n.
</p>
</div>
<div id="outline-container-orge93317b" class="outline-3">
<h3 id="orge93317b"><span class="section-number-3">4.1</span> Integer Programming Model (for VP)</h3>
<div class="outline-text-3" id="text-4-1">
\begin{align*}
	\mbox{Maximize: } & cx \\
	\mbox{Subject to: } & Ax \leq e \\
				& x \in \{0, 1\}
\end{align*}
<ol class="org-ol">
<li>A is a p &times; n matrix a<sub>hi</sub> = 1 means vertex i &isin; edge h</li>
<li>e is a all-one vector.</li>
<li>&rArr; Ax &le; e means that each edges 2 end-points should not
be in the answer x simutaneously.</li>
</ol>
</div>
</div>
<div id="outline-container-org7627627" class="outline-3">
<h3 id="org7627627"><span class="section-number-3">4.2</span> Prefect Graph</h3>
<div class="outline-text-3" id="text-4-2">
<p>
chromatic number = maximum clique cardinality (for each G' \(\subseteq\) G)
</p>
</div>
</div>
<div id="outline-container-org25bb10c" class="outline-3">
<h3 id="org25bb10c"><span class="section-number-3">4.3</span> Integer Programming Model (for GVP-k)</h3>
<div class="outline-text-3" id="text-4-3">
\begin{align*}
 \mbox{Maximize: } & cx \\
 \mbox{Subject to: } & \sum_{(i,j) \in E} z_{ij} \leq k \\
 & z_{ij} \geq x_i + x_j - 1, z_{ij} \geq 0 \\
 & x_j \in \{0, 1\}, \forall j \in N
\end{align*}
<p>
note that edge (i, j) is in the answer when \(z_{ij} = 1 = x_ix_j\)
</p>
</div>
</div>
</div>
<div id="outline-container-orgdafd593" class="outline-2">
<h2 id="orgdafd593"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Facets and partial convex hull representations for GVP-k</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-01-22 Tue 23:50] </span></span> <br />
some note for test</li>
</ul>
<p>
<b>Proposition 1</b>: Consider a graph G and a subgraph \(\hat{G}\) of G. 
If Dx &le; d represents a set of valid inequalities for GVP-k deﬁned on \(\hat{G}\), 
then Dx &le; d is valid for GVP-k deﬁned on G. 
</p>

<p>
<b>Proof</b>: Since GVP-k for \(\hat{G}\) is a relaxation of GVP-k deﬁned on G, 
the <span class="underline">restrictions</span> that govern a feasible generalized vertex packing
solution on \(\hat{G}\) are a subset of those valid for G. This completes the proof.
</p>

<p>
<b>Note</b>: You could use less restrictions on \(\hat{G}\) than on G (maybe a subset).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 陈小羽</p>
<p class="date">Created: 2019-01-22 Tue 23:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
